Revit 2024 API
ParameterTypeId.RebarShapeParamEndHookTanLen Property
 "End Tangent Hook Length"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RebarShapeParamEndHookTanLen { get; }
Visual Basic
Public Shared ReadOnly Property RebarShapeParamEndHookTanLen As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RebarShapeParamEndHookTanLen {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace